In [45]:
import os
from datetime import datetime
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [46]:
# Load the csv datasets into pandas dataframes
dataset_dir = os.path.join(os.getcwd(), 'dataset')

customer_csv = os.path.join(dataset_dir, 'Customer.csv')
customer_df = pd.read_csv(customer_csv)

In [47]:
# Set to lowercase all column names except 'city_code' for easier reference
# Set 'DOB' to 'year', because only birth year will be extracted later on
customer_df_col_map = {
    'customer_Id': 'customer_id',
    'DOB': 'birth_year',
    'Gender': 'gender'
}
customer_df.rename(columns=customer_df_col_map, inplace=True)

In [48]:
customer_df.describe(include='all')

          customer_id  birth_year gender    city_code
count     5647.000000        5647   5645  5645.000000
unique            NaN        4056      2          NaN
top               NaN  27-12-1988      M          NaN
freq              NaN           7   2892          NaN
mean    271037.281034         NaN    NaN     5.472631
std       2451.261711         NaN    NaN     2.859918
min     266783.000000         NaN    NaN     1.000000
25%     268912.000000         NaN    NaN     3.000000
50%     271028.000000         NaN    NaN     5.000000
75%     273180.000000         NaN    NaN     8.000000
max     275265.000000         NaN    NaN    10.000000

In [49]:
customer_df.isna().sum()

customer_id    0
birth_year     0
gender         2
city_code      2
dtype: int64

In [50]:
customer_df.dropna(inplace=True)
customer_df.reset_index(drop=True, inplace=True)

In [51]:
# Transform the former DOB column to Year only
customer_df['birth_year'] = customer_df['birth_year'].apply(lambda x: datetime.strptime(x, '%d-%m-%Y').year)

In [52]:
customer_df.head()

   customer_id  birth_year gender  city_code
0       268408        1970      M        4.0
1       269696        1970      F        8.0
2       268159        1970      F        8.0
3       270181        1970      F        2.0
4       268073        1970      M        1.0

In [53]:
prodcat_csv = os.path.join(dataset_dir, 'prod_cat_info.csv')
prodcat_df = pd.read_csv(prodcat_csv)

In [54]:
prodcat_df.dtypes

prod_cat_code         int64
prod_cat             object
prod_sub_cat_code     int64
prod_subcat          object
dtype: object

In [55]:
# Rename column prod_subcat to prod_sub_cat for consistency
prodcat_df.rename(columns={'prod_subcat': 'prod_sub_cat'}, inplace=True)

In [56]:
prodcat_df.head()

   prod_cat_code  prod_cat  prod_sub_cat_code prod_sub_cat
0              1  Clothing                  4         Mens
1              1  Clothing                  1        Women
2              1  Clothing                  3         Kids
3              2  Footwear                  1         Mens
4              2  Footwear                  3        Women

In [57]:
transact_csv = os.path.join(dataset_dir, 'Transactions.csv')
transact_df = pd.read_csv(transact_csv)
transact_df.head()

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
0,80712190438,270351,28-02-2014,1,1,-5,-772,405.300,-4265.300,e-Shop
1,29258453508,270384,27-02-2014,5,3,-5,-1497,785.925,-8270.925,e-Shop
2,51750724947,273420,24-02-2014,6,5,-2,-791,166.110,-1748.110,TeleShop
3,93274880719,271509,24-02-2014,11,6,-3,-1363,429.345,-4518.345,e-Shop
4,51750724947,273420,23-02-2014,6,5,-2,-791,166.110,-1748.110,TeleShop

In [58]:
transact_df.describe(include='all')

,transaction_id,cust_id,tran_date,prod_subcat_code,prod_cat_code,Qty,Rate,Tax,total_amt,Store_type
count,2.305300e+04,23053.000000,23053,23053.000000,23053.000000,23053.000000,23053.000000,23053.000000,23053.000000,23053
unique,NaN,NaN,1129,NaN,NaN,NaN,NaN,NaN,NaN,4
top,NaN,NaN,13-07-2011,NaN,NaN,NaN,NaN,NaN,NaN,e-Shop
freq,NaN,NaN,35,NaN,NaN,NaN,NaN,NaN,NaN,9311
mean,5.007348e+10,271021.746497,NaN,6.149091,3.763632,2.432395,636.369713,248.667192,2107.308002,NaN
std,2.898194e+10,2431.692059,NaN,3.726372,1.677016,2.268406,622.363498,187.177773,2507.561264,NaN
min,3.268991e+06,266783.000000,NaN,1.000000,1.000000,-5.000000,-1499.000000,7.350000,-8270.925000,NaN
25%,2.493864e+10,268935.000000,NaN,3.000000,2.000000,1.000000,312.000000,98.280000,762.450000,NaN
50%,5.009313e+10,270980.000000,NaN,5.000000,4.000000,3.000000,710.000000,199.080000,1754.740000,NaN
75%,7.533000e+10,273114.000000,NaN,10.000000,5.000000,4.000000,1109.000000,365.715000,3569.150000,NaN
max,9.998755e+10,275265.000000,NaN,12.000000,6.000000,5.000000,1500.000000,787.500000,8287.500000,NaN

In [59]:
# Set to lowercase these columns of transact_df for easier reference
transact_df_col_map = {
    'cust_id': 'customer_id',
    'prod_subcat_code': 'prod_sub_cat_code',
    'Qty': 'qty',
    'Rate': 'rate',
    'Tax': 'tax',
    'Store_type': 'store_type',
    'tran_date': 'transact_date'
}
transact_df.rename(columns=transact_df_col_map, inplace=True)

In [60]:
# Remove the rows where qty is less than 1
rows_to_drop = transact_df[transact_df['qty'] < 1].index
transact_df.drop(rows_to_drop, axis=0, inplace=True)
transact_df.reset_index(drop=True, inplace=True)

In [61]:
# Convert tran_date to a date object
# This column has a mix of dates formatted in DD-MM-YYYY and DD/MM/YYYY, so pandas.to_datetime with dayfirst=True param is used
transact_df['transact_date'] = pd.to_datetime(transact_df['transact_date'], dayfirst=True)
transact_df.dtypes

transaction_id                int64
customer_id                   int64
transact_date        datetime64[ns]
prod_sub_cat_code             int64
prod_cat_code                 int64
qty                           int64
rate                          int64
tax                         float64
total_amt                   float64
store_type                   object
dtype: object

In [62]:
transact_df.transact_date.dt.year

0        2014
1        2014
2        2014
3        2014
4        2014
         ...
20871    2011
20872    2011
20873    2011
20874    2011
20875    2011
Name: transact_date, Length: 20876, dtype: int64

In [63]:
transact_df['transact_year'] = transact_df['transact_date'].dt.year
transact_df['transact_month'] = transact_df['transact_date'].dt.month
transact_df.head()

,transaction_id,customer_id,transact_date,prod_sub_cat_code,prod_cat_code,qty,rate,tax,total_amt,store_type,transact_year,transact_month
0,29258453508,270384,2014-02-20,5,3,5,1497,785.925,8270.925,e-Shop,2014,2
1,25455265351,267750,2014-02-20,12,6,3,1360,428.400,4508.400,e-Shop,2014,2
2,1571002198,275023,2014-02-20,6,5,4,587,246.540,2594.540,e-Shop,2014,2
3,36554696014,269345,2014-02-20,3,5,3,1253,394.695,4153.695,e-Shop,2014,2
4,56814940239,268799,2014-02-20,7,5,5,368,193.200,2033.200,e-Shop,2014,2

In [64]:
# Use pandasql to easily merge the three datasets together
from pandasql import sqldf

In [65]:
merged_df = lambda query: sqldf(query, globals())
query = """
    SELECT
        t.*,
        c.birth_year,
        c.gender,
        c.city_code,
        p.prod_cat,
        p.prod_sub_cat
    FROM transact_df t
    INNER JOIN customer_df c
        on c.customer_id = t.customer_id
    INNER JOIN prodcat_df p
        ON p.prod_cat_code = t.prod_cat_code
        AND p.prod_sub_cat_code = t.prod_sub_cat_code
"""
merged_df = merged_df(query)

In [66]:
merged_df.head()

,transaction_id,customer_id,transact_date,prod_sub_cat_code,prod_cat_code,qty,rate,tax,total_amt,store_type,transact_year,transact_month,birth_year,gender,city_code,prod_cat,prod_sub_cat
0,29258453508,270384,2014-02-20 00:00:00.000000,5,3,5,1497,785.925,8270.925,e-Shop,2014,2,1973,F,8.0,Electronics,Computers
1,25455265351,267750,2014-02-20 00:00:00.000000,12,6,3,1360,428.400,4508.400,e-Shop,2014,2,1986,M,1.0,Home and kitchen,Tools
2,1571002198,275023,2014-02-20 00:00:00.000000,6,5,4,587,246.540,2594.540,e-Shop,2014,2,1971,M,6.0,Books,DIY
3,36554696014,269345,2014-02-20 00:00:00.000000,3,5,3,1253,394.695,4153.695,e-Shop,2014,2,1970,F,10.0,Books,Comics
4,56814940239,268799,2014-02-20 00:00:00.000000,7,5,5,368,193.200,2033.200,e-Shop,2014,2,1979,M,9.0,Books,Fiction

In [68]:
merged_df.dtypes

transaction_id         int64
customer_id            int64
transact_date         object
prod_sub_cat_code      int64
prod_cat_code          int64
qty                    int64
rate                   int64
tax                  float64
total_amt            float64
store_type            object
transact_year          int64
transact_month         int64
birth_year             int64
gender                object
city_code            float64
prod_cat              object
prod_sub_cat          object
dtype: object

In [69]:
# Add column of age at time of purchase
merged_df['age_at_purchase'] = merged_df['transact_year'] - merged_df['birth_year']